Revit 2027 API
ParameterTypeId.DimNotModifiable Property
 "Non-modifiable"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimNotModifiable { get; }
Public Shared ReadOnly Property DimNotModifiable As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimNotModifiable {
	ForgeTypeId^ get ();
}
static member DimNotModifiable : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace